; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 10994)
	(= (fuel plane1) 361)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 11)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 3)
	(at plane2 city3)
	(= (capacity plane2) 2919)
	(= (fuel plane2) 517)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 2)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 8)
	(at plane3 city2)
	(= (capacity plane3) 6324)
	(= (fuel plane3) 1060)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 11)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 1)
	(at person1 city2)
	(at person2 city1)
	(at person3 city0)
	(at person4 city0)
	(at person5 city3)
	(at person6 city1)
	(at person7 city0)
	(at person8 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 566)
	(= (distance city0 city2) 871)
	(= (distance city0 city3) 726)
	(= (distance city1 city0) 566)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 551)
	(= (distance city1 city3) 810)
	(= (distance city2 city0) 871)
	(= (distance city2 city1) 551)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 523)
	(= (distance city3 city0) 726)
	(= (distance city3 city1) 810)
	(= (distance city3 city2) 523)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city1)
	(at plane2 city2)
	(at person1 city2)
	(at person2 city2)
	(at person3 city3)
	(at person4 city2)
	(at person5 city0)
	(at person6 city0)
	(at person7 city3)
	(at person8 city2)
	))

(:metric minimize (+ (* 3 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane2 city3)
   changed: (fuel plane2) from 517 to 2919
   goals met: 3 of 10
2. (fly plane2 city3 city1)
   deleted: (at plane2 city3)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 0 to 810, (fuel plane2) from 2919 to 2109
   goals met: 3 of 10
3. (board person2 plane2 city1)
   deleted: (at person2 city1)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 3 of 10
4. (board person6 plane2 city1)
   deleted: (at person6 city1)
   added: (in person6 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 3 of 10
5. (fly plane2 city1 city2)
   deleted: (at plane2 city1)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 810 to 1361, (fuel plane2) from 2109 to 1558
   goals met: 4 of 10
6. (debark person2 plane2 city2)
   deleted: (in person2 plane2)
   added: (at person2 city2)
   changed: (onboard plane2) from 2 to 1
   goals met: 5 of 10
7. (fly plane2 city2 city3)
   deleted: (at plane2 city2)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 1361 to 1884, (fuel plane2) from 1558 to 1035
   goals met: 4 of 10
8. (board person5 plane2 city3)
   deleted: (at person5 city3)
   added: (in person5 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 4 of 10
9. (fly plane2 city3 city0)
   deleted: (at plane2 city3)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 1884 to 2610, (fuel plane2) from 1035 to 309
   goals met: 4 of 10
10. (debark person5 plane2 city0)
   deleted: (in person5 plane2)
   added: (at person5 city0)
   changed: (onboard plane2) from 2 to 1
   goals met: 5 of 10
11. (debark person6 plane2 city0)
   deleted: (in person6 plane2)
   added: (at person6 city0)
   changed: (onboard plane2) from 1 to 0
   goals met: 6 of 10
12. (refuel plane2 city0)
   changed: (fuel plane2) from 309 to 2919
   goals met: 6 of 10
13. (board person3 plane2 city0)
   deleted: (at person3 city0)
   added: (in person3 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 6 of 10
14. (board person4 plane2 city0)
   deleted: (at person4 city0)
   added: (in person4 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 6 of 10
15. (board person7 plane2 city0)
   deleted: (at person7 city0)
   added: (in person7 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 6 of 10
16. (fly plane2 city0 city2)
   deleted: (at plane2 city0)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 2610 to 3481, (fuel plane2) from 2919 to 2048
   goals met: 7 of 10
17. (debark person4 plane2 city2)
   deleted: (in person4 plane2)
   added: (at person4 city2)
   changed: (onboard plane2) from 3 to 2
   goals met: 8 of 10
18. (fly plane2 city2 city3)
   deleted: (at plane2 city2)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 3481 to 4004, (fuel plane2) from 2048 to 1525
   goals met: 7 of 10
19. (debark person3 plane2 city3)
   deleted: (in person3 plane2)
   added: (at person3 city3)
   changed: (onboard plane2) from 2 to 1
   goals met: 8 of 10
20. (debark person7 plane2 city3)
   deleted: (in person7 plane2)
   added: (at person7 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 9 of 10
21. (fly plane2 city3 city2)
   deleted: (at plane2 city3)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 4004 to 4527, (fuel plane2) from 1525 to 1002
   goals met: 10 of 10
